# -*- coding: utf-8 -*-

CONTENT = """
Чемпионат:
Синхронный турнир "18+"

URL:
/znatoki/boris/reports/201304EighteenPlus.html

Дата:
27-Apr-2013

Редактор:
Дмитрий Смирнов (Москва)

Тур:
Внезачетный вопрос

Вопрос 1:
Внимание, в вопросе есть замены.
   11 апреля 1906 года по Москве поползли слухи, что собравшаяся по
случаю Радоницы толпа достала ДОМИК ГРАЧА и разнесла его на части.
Другой слух утверждал, что ДОМИК ГРАЧА перенесен властями специально в
другое место во избежание паломничества. Сегодня вам будут предложены в
числе прочего и фирменные ГРАЧИНЫЕ "ДОМИКИ", которые, как надеется
редактор пакета, не омрачат ваше удовольствие от игры. Какие два слова в
вопросе заменены на "ГРАЧИНЫЕ ДОМИКИ"?

Ответ:
Бауманские гробы.

Комментарий:
ДОМИК - гроб (старорусское слово "домовина" синонимично слову "гроб"),
ГРАЧ - Бауман (революционер Николай Бауман имел партийную кличку
"Грач"). Бауманский клуб знатоков иногда грешит наличием в пакетах своих
чемпионатов неберущихся вопросов, или "гробов" на сленге знатоков.

Источник:
   1. Газета "Вечерняя Москва", 13.04.2006 г. - С. 38.
   2. ЛНАВ.

Автор:
Дмитрий Смирнов (Москва)

Тур:
1 тур

Вопрос 1:
Значение этого русского оборота во многом сформировалось благодаря его
вхождению в знахарское заклинание, вторая часть которого звучала так:
"... с нашего мальчика/девочки худоба". Другая пословица, включавшая в
себя тот же оборот, употреблялась применительно к клевете, навету. О
каком обороте идет речь?

Ответ:
"Как с гуся вода...".

Комментарий:
Другая пословица - "Как с гуся вода, небывалые слова".

Источник:
   1. http://rus.1september.ru/article.php?ID=200203103
   2. http://www.poskart.ru/nebivalie-slova.html

Автор:
Дмитрий Смирнов (Москва)


"""

RESULTS = [('Вопрос 1:\n',
            'Внимание, в вопросе есть замены.\n   11 апреля 1906 года по Москве поползли слухи, что собравшаяся по\nслучаю Радоницы толпа достала ДОМИК ГРАЧА и разнесла его на части.\nДругой слух утверждал, что ДОМИК ГРАЧА перенесен властями специально в\nдругое место во избежание паломничества. Сегодня вам будут предложены в\nчисле прочего и фирменные ГРАЧИНЫЕ "ДОМИКИ", которые, как надеется\nредактор пакета, не омрачат ваше удовольствие от игры. Какие два слова в\nвопросе заменены на "ГРАЧИНЫЕ ДОМИКИ"?\n',
            'Ответ:',
            'Бауманские гробы.\n\nКомментарий:\nДОМИК - гроб (старорусское слово "домовина" синонимично слову "гроб"),\nГРАЧ - Бауман (революционер Николай Бауман имел партийную кличку\n"Грач"). Бауманский клуб знатоков иногда грешит наличием в пакетах своих\nчемпионатов неберущихся вопросов, или "гробов" на сленге знатоков.\n\nИсточник:\n   1. Газета "Вечерняя Москва", 13.04.2006 г. - С. 38.\n   2. ЛНАВ.\n\nАвтор:\nДмитрий Смирнов (Москва)\n'),
           ('Вопрос 1:\n',
            'Значение этого русского оборота во многом сформировалось благодаря его\nвхождению в знахарское заклинание, вторая часть которого звучала так:\n"... с нашего мальчика/девочки худоба". Другая пословица, включавшая в\nсебя тот же оборот, употреблялась применительно к клевете, навету. О\nкаком обороте идет речь?\n',
            'Ответ:',
            '"Как с гуся вода...".\n\nКомментарий:\nДругая пословица - "Как с гуся вода, небывалые слова".\n\nИсточник:\n   1. http://rus.1september.ru/article.php?ID=200203103\n   2. http://www.poskart.ru/nebivalie-slova.html\n\nАвтор:\nДмитрий Смирнов (Москва)\n\n')]
